In [1]:
# pip install pymysql sqlalchemy mysql-connector-python

In [2]:
import pandas as pd
import numpy as np
import pymysql

import warnings
warnings.filterwarnings("ignore")
from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://root:root@localhost:3306/sales_dw")

In [3]:
customers = pd.read_csv(r"C:\Users\Shree\Desktop\Sales_ETL_Project\data\customers.csv")
products = pd.read_csv(r"C:\Users\Shree\Desktop\Sales_ETL_Project\data\products.csv")
orders = pd.read_csv(r"C:\Users\Shree\Desktop\Sales_ETL_Project\data\orders.csv")
order_items = pd.read_csv(r"C:\Users\Shree\Desktop\Sales_ETL_Project\data\order_items.csv")

In [4]:
orders["order_date"] = pd.to_datetime(orders["order_date"])

In [5]:
customers.drop_duplicates(inplace=True)
products.drop_duplicates(inplace=True)
orders.drop_duplicates(inplace=True)
order_items.drop_duplicates(inplace=True)

In [6]:
dim_customer = customers.copy()
dim_customer.head()

   customer_id customer_name                  email       city        state
0            1  Customer_001  customer001@gmail.com     Mumbai  Maharashtra
1            2  Customer_002  customer002@gmail.com       Pune  Maharashtra
2            3  Customer_003  customer003@gmail.com    Chennai   Tamil Nadu
3            4  Customer_004  customer004@gmail.com  Hyderabad    Telangana
4            5  Customer_005  customer005@gmail.com  Hyderabad    Telangana

In [7]:
dim_product = products.copy()
dim_product.head()

   product_id product_name     category    price
0           1  Product_001  Electronics  1903.97
1           2  Product_002         Home  4756.04
2           3  Product_003         Toys  3673.37
3           4  Product_004       Beauty  3013.36
4           5  Product_005       Sports   822.29

In [8]:
orders["order_date"] = pd.to_datetime(orders["order_date"])

dim_date = pd.DataFrame()
dim_date["date"] = pd.date_range(
    start=orders["order_date"].min(),
    end=orders["order_date"].max(),
    freq="D"
)

dim_date["date_key"] = dim_date["date"].dt.strftime("%Y%m%d").astype(int)
dim_date["year"] = dim_date["date"].dt.year
dim_date["month"] = dim_date["date"].dt.month
dim_date["month_name"] = dim_date["date"].dt.strftime("%B")
dim_date["quarter"] = dim_date["date"].dt.quarter

In [9]:
orders["order_date"] = pd.to_datetime(orders["order_date"])

merged1 = pd.merge(order_items, orders, on="order_id", how="inner")
merged2 = pd.merge(merged1, products, on="product_id", how="inner")

merged2["total_amount"] = merged2["quantity"] * merged2["unit_price"]
merged2["order_date_key"] = merged2["order_date"].dt.strftime("%Y%m%d").astype(int)

fact_sales = merged2.reset_index().rename(columns={"index": "sale_id"})[
    ["sale_id", "order_id", "customer_id", "product_id",
     "quantity", "unit_price", "total_amount", "order_date_key"]
]
dim_date.head()

        date  date_key  year  month month_name  quarter
0 2024-01-01  20240101  2024      1    January        1
1 2024-01-02  20240102  2024      1    January        1
2 2024-01-03  20240103  2024      1    January        1
3 2024-01-04  20240104  2024      1    January        1
4 2024-01-05  20240105  2024      1    January        1

In [10]:
dim_customer.to_sql("dim_customer", engine, if_exists="replace", index=False)
dim_product.to_sql("dim_product", engine, if_exists="replace", index=False)
dim_date.to_sql("dim_date", engine, if_exists="replace", index=False)
fact_sales.to_sql("fact_sales", engine, if_exists="replace", index=False)

3808

In [11]:
connection = pymysql.connect(
    host='localhost', user='root', password='root', database='sales_dw'
)

query = """
SELECT p.category, SUM(f.total_amount) as revenue
FROM fact_sales f
JOIN dim_product p ON f.product_id = p.product_id
GROUP BY p.category
ORDER BY revenue DESC;
"""

pd.read_sql(query, connection)

      category     revenue
0       Sports  5202107.04
1  Electronics  3909683.20
2     Clothing  3604396.81
3       Beauty  3446941.39
4         Home  3248819.05
5        Books  3183985.45
6         Toys  2789339.18
7      Grocery  1797564.66